In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.read_csv("States/first_state")

In [3]:
df1.head(3)

,Unnamed: 0,location,size,total_sqft,bath,balcony,price,bhk,price_per_sqft
0,0,Electronic City Phase II,2 BHK,1056.0,2.0,1.0,39.07,2,3699.810606
1,1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,3.0,120.00,4,4615.384615
2,2,Uttarahalli,3 BHK,1440.0,2.0,3.0,62.00,3,4305.555556

In [4]:
df1 = df1.drop('Unnamed: 0', axis='columns')

In [5]:
df1.head(3)

,location,size,total_sqft,bath,balcony,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,1.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,3.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,3.0,62.00,3,4305.555556

In [6]:
len(df1.location.unique())

1304

In [7]:
df1.location = df1.location.apply(lambda x: x.strip())

In [8]:
locations_count = df1['location'].value_counts(ascending=False)
locations_count

location
Whitefield                        535
Sarjapur  Road                    392
Electronic City                   304
Kanakpura Road                    266
Thanisandra                       236
                                 ...
Vasantapura main road               1
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
Abshot Layout                       1
Name: count, Length: 1293, dtype: int64

In [9]:
for i in df1['location']:
    if i not in locations_count:
        print(i)

In [10]:
len(locations_count[locations_count>10])

241

In [11]:
location_less_than_10 = locations_count[locations_count<=10]
location_less_than_10

location
Naganathapura                     10
Sadashiva Nagar                   10
Nagappa Reddy Layout              10
BTM 1st Stage                     10
Sector 1 HSR Layout               10
                                  ..
Vasantapura main road              1
Bapuji Layout                      1
1st Stage Radha Krishna Layout     1
BEML Layout 5th stage              1
Abshot Layout                      1
Name: count, Length: 1052, dtype: int64

In [12]:
df2 = df1.copy()

In [13]:
df2.location = df2.location.apply(lambda X:'other' if X in location_less_than_10 else X)

In [14]:
df2.head(10)

,location,size,total_sqft,bath,balcony,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,1.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,3.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,3.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,1.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,1.0,51.00,2,4250.000000
5,Whitefield,2 BHK,1170.0,2.0,1.0,38.00,2,3247.863248
6,Old Airport Road,4 BHK,2732.0,4.0,1.0,204.00,4,7467.057101
7,Rajaji Nagar,4 BHK,3300.0,4.0,1.0,600.00,4,18181.818182
8,Marathahalli,3 BHK,1310.0,3.0,1.0,63.25,3,4828.244275
9,other,6 Bedroom,1020.0,6.0,1.0,370.00,6,36274.509804

In [24]:
df2[df2.bhk>30]

,location,size,total_sqft,bath,balcony,price,bhk,price_per_sqft
4654,Munnekollal,43 Bedroom,2400.0,40.0,0.0,660.0,43,27500.0

In [28]:
df2[df2.total_sqft/df2.bhk<300].head()

,location,size,total_sqft,bath,balcony,price,bhk,price_per_sqft
9,other,6 Bedroom,1020.0,6.0,1.0,370.0,6,36274.509804
45,HSR Layout,8 Bedroom,600.0,9.0,1.0,200.0,8,33333.333333
57,Murugeshpalya,6 Bedroom,1407.0,4.0,1.0,150.0,6,10660.980810
67,Devarachikkanahalli,8 Bedroom,1350.0,7.0,0.0,85.0,8,6296.296296
69,other,3 Bedroom,500.0,3.0,2.0,100.0,3,20000.000000

In [29]:
len(df2[df2.total_sqft/df2.bhk<300])

744

In [30]:
df2.shape

(13246, 8)

In [31]:
df3 = df2[~(df2['total_sqft']/df2['bhk']<300)]
df3.shape

(12502, 8)

In [72]:
def remove_outliers(df):
    out_lier = pd.DataFrame()
    for key, subdf in df.groupby('location'):
        m = np.mean(subdf.price_per_sqft)
        st = np.std(subdf.price_per_sqft)
        reduced_df = subdf[(subdf.price_per_sqft>(m-st)) & (subdf.price_per_sqft<=(m+st))]
        out_lier = pd.concat([out_lier, reduced_df], ignore_index=True)
    return out_lier

In [ ]:
def remove_pps_outliers(df):
    df_out = pd.DataFrame()
    for key, subdf in df.groupby('location'):
        m = np.mean(subdf.price_per_sqft)
        st = np.std(subdf.price_per_sqft)
        reduced_df = subdf[(subdf.price_per_sqft>(m-st)) & (subdf.price_per_sqft<=(m+st))]
        df_out = pd.concat([df_out,reduced_df],ignore_index=True)
    return df_out

In [74]:
df4 = remove_outliers(df3)
df4.shape

(10241, 8)

In [75]:
df4.to_csv('States/second_state')